<S>
</S>
<UNK>
21224
8197
15274
7664
7706
4246
19311
14123
12772
12617
1027
3948
16512
21097
10925
11123
19421
4846
4216
159
3166
6102
2699
9391
10789
7384
18826
16046
5163
17219
17145
16496
17597
13751
15822
2128
2289
20027
16712
17186
2819
18538
19006
5025
11255
2034
20451
9779
4859
20583
14126
20359
17681
3452
17166
12062
15345
14937
4104
14077
13513
6754
10609
3445
2379
10341
13670
13552
14091
16201
20170
20743
19215
1856
14477
6967
17565
20620
3253
8649
14459
3009
13494
17325
16980
15020
16806
567
4106
1961
13781
20958
2969
3277
20859
954
19365
18158
2649
19184
11664
12943
13519
1886
11642
14747
4921
882
6006
6196
19285
14812
4718
6303
13553
9088
17225
16805
1668
3988
9906
3545
4779
11188
6254
6642
6112
5863
1847
17592
13862
10092
17083
1819
16374
15426
7938
7747
16688
4688
18199
8387
7106
7649
15788
9007
8487
10223
19936
586
533
6000
3647
15556
20813
18571
14360
12302
10037
14499
13614
16419
16929
968
7047
14244
15060
13309
13426
16113
2240
8217
6051
19675
16654
2658
11033
15785
7379
3380
19934
9954
2003
2250
12172
14478
6437
17808
9732
16435
12851
5379
15140
10072
15034
9199
5808
17337
19258
19425
7501
7251
20815
4387
9887
8379
3424
11806
7105
14978
20279
6991
19832
17427
20600
13487
6478
19638
8064
19453
15582
19851
12610
14199
8373
11122
1965
5759
8617
17964
17348
12751
6625
13940
46
14253
5190
3133
400
10158
17304
18736
4929
20573
17667
4935
17370
16362
1173
3191
2483
16546
5391
9005
10627
11581
10512
5870
11167
8505
695
7438
14132
20808
7230
1223
16979
10571
3061
3083
17622
11972
2557
19302
3028
17759
18705
11685
12607
18802
2680
927
17047
4703
10841
18799
19616
10455
4223
6891
6312
6299
2797
19061
15718
14498
9701
5026
9433
15492
11103
15762
7990
2643
297
8489
4758
3738
4954
4190
10690
13248
14640
8344
19877
5985
6522
18053
19120
4808
23
4948
10920
875
511
13529
5626
10399
19864
16816
11068
19356
2702
18288
9211
16327
10870
19853
13046
15692
8572
3999
2771
9187
11924
20544
10777
3809
1353
10332
10536
1488
5908
15212
5810
11743
1519
14675
974
9460
4886
2161
8885
14346
13664
17457
5930
14033
2896
18496
18620
497
4243
9679
11331
14358
12266
8038
4077
6484
17624
6306
14277
17600
11735
13821
15964
17359
5390
8952
17732
9267
11746
4616
6384
11543
20201
204
13159
16885
16498
2041
18173
13129
15287
1984
3047
13170
4244
14582
15372
16623
13317
17516
6181
17789
10516
21145
6858
12333
6255
19529
709
9942
18094
659
6733
861
1866
12911
7040
2764
537
8041
15462
21125
14722
9442
12540
962
15712
13040
286
10903
4513
15033
17126
6258
4840
4988
8467
7380
18952
2869
12721
7420
6471
5368
20129
9350
13146
10938
20148
18282
6600
4581
5736
19127
14790
4750
19534
19907
4570
7020
11384
6623
15041
10270
19172
18038
14867
1514
14803
6353
58
11996
13696
971
20048
18016
18660
18781
19315
5966
2849
2438
5635
19543
14658
3441
14564
17031
17532
5616
8715
14286
17159
2641
17735
14422
15655
13924
16077
1457
9860
16093
7069
2256
8808
13968
8428
6164
21131
162
6201
11249
18102
15799
6068
4204
19828
12252
3248
17506
6682
14169
17409
11553
9233
9180
10869
12469
20611
4250
15574
9254
11990
21115
10619
2432
9312
9186
13004
11043
1801
3510
7917
9629
17831
7199
4275
2242
20684
5557
13711
16369
17773
7942
1250
5815
3421
19752
5797
18057
6329
9499
11378
13550
18732
9089
160
3768
9933
708
1939
18059
5332
12164
18850
20790
6594
16288
768
14796
8141
11530
10247
5018
19429
8354
12093
4864
7659
9452
7769
9481
5156
6042
6135
14313
4350
15324
10763
17281
19952
8112
21195
6574
632
12788
12299
4211
6463
689
10083
17000
17939
18103
19987
14903
15428
19234
19200
3323
11329
20588
19247
19536
4034
19181
15838
17851
14839
6040
8077
3486
1032
20667
2709
6523
4967
11385
132
17909
1911
8523
3625
18097
3267
11367
19134
11499
5067
14523
19415
7432
7523
15920
17712
9473
10075
10520
20440
14784
18056
6174
19807
14815
10729
9001
16217
15950
7007
20168
1784
19229
4273
8551
19977
9220
19224
3967
3935
4191
18100
17136
15913
16722
5008
6997
5157
8110
14949
10427
20365
19092
17834
17682
18341
634
2485
8691
20470
416
15259
3976
7096
7232
12985
10229
4089
16254
5852
16687
16108
8179
304
11605
2273
20224
3862
6839
2457
18958
10965
9576
19618
7994
10432
18659
7700
13544
4526
21178
700
7629
2830
16222
15671
6225
20449
19813
8806
11099
7820
20284
2984
18928
19735
12643
8868
1827
15915
20138
17488
7529
3786
11431
18430
15699
5724
17885
717
1166
1215
1269
6601
9479
635
1581
9405
2729
11310
9401
9675
4183
19074
2203
12664
10545
10803
19592
19808
5848
11133
10063
3868
14723
16873
9921
18641
10765
8325
11622
9079
12992
9361
2696
10141
16110
20372
16718
959
16789
8317
19204
16948
6086
16195
17705
15673
16906
19776
18535
1769
13789
4487
14642
13280
13843
21215
14854
10524
4167
1625
18393
3249
2974
1884
3157
1749
6005
4163
10352
7593
9685
14350
9298
4114
983
3134
13593
16105
3888
20411
17475
16357
8814
20827
16872
6706
15874
20691
14039
7995
4615
984
15193
12488
2568
2422
14481
3007
12307
3343
20312
20247
16993
20035
13014
13623
5457
17104
8584
15898
11934
3970
15294
12666
6092
1033
11487
4528
9910
7731
12082
14320
7518
18318
9409
6850
9221
6930
13092
10000
18988
16550
20310
5717
20869
14085
11505
20725
1043
2513
2276
17019
10013
8640
336
2361
12884
15025
13480
7411
241
1059
21141
19716
16138
2051
6130
13135
7647
18699
10800
13002
18971
7605
19665
8907
14684
6036
10850
14908
16730
964
957
14002
15709
11250
9655
18771
12850
18372
19214
3981
16449
8746
4530
15612
581
2492
18403
18128
897
16679
13514
7859
4598
3454
4091
9249
3468
5540
19570
16957
18347
5647
19370
17797
19823
18101
12193
14461
8738
14714
10962
10134
18962
3872
11541
14196
13851
2473
1969
3431
15669
12256
15465
7111
21023
10951
16468
16879
13534
670
890
1966
3722
11689
13221
3682
17765
14464
8033
10671
7684
18113
6093
11702
3669
20821
9068
12474
10226
6422
19316
11679
12052
18593
16908
9730
21163
20733
4218
1595
13964
3642
18241
6710
20732
16149
12659
15468
4509
20849
9234
18474
19024
5918
6229
19479
16820
538
13767
18830
15594
11652
8358
6816
3310
17606
16199
1432
1274
31
12083
12228
17441
10890
1898
17998
18968
9070
5711
18541
17430
787
3662
14971
8891
8743
9435
18222
12502
6443
10272
1278
11727
1910
5564
2801
15978
15596
15580
2604
9901
16866
12518
5323
2052
10293
4893
16341
2687
16061
11927
10575
4150
10985
14309
12080
15682
1146
18330
6018
7755
11276
14428
21052
2668
10053
19976
8333
8122
10249
19916
2008
2135
11557
19222
6060
6088
4140
5227
10754
9661
12541
11198
7255
19741
9741
17228
7377
5718
12324
2402
364
19517
357
15833
1511
21035
9056
8792
7272
8014
4939
2997
19890
2076
2881
3621
942
18227
11309
1727
21209
9279
11612
16075
21155
3596
20298
10720
11185
6662
1702
18521
11196
1260
607
356
9683
9717
8772
12797
21082
5330
7236
11634
10940
542
18485
1308
10699
14673
13010
19552
8637
3591
7672
20707
4229
15629
1530
10706
17363
18941
5779
5470
15111
378
3219
6736
1046
14930
4517
21046
4545
16073
14383
8601
18551
6540
1016
11300
14146
11352
7941
11656
2573
4767
13333
3568
10807
9327
1054
17220
17813
15227
9600
2083
10355
3500
10537
16784
5857
12550
8154
17956
2822
9196
3122
13582
685
16710
15260
20172
6610
4432
13680
10589
18894
8789
19090
4481
75
234
5537
20380
20393
4875
15567
11659
8337
9443
17296
8456
13966
4903
10204
17691
19041
5844
3268
11865
9697
4493
11221
10259
4271
1639
5884
6916
15293
20901
2525
15349
1598
13266
15758
21025
6003
11298
15828
20426
12470
17863
18054
8794
6765
21117
4088
5861
5767
17389
10886
7802
4200
11277
11061
20353
19174
6057
2625
16534
9253
12076
1942
12294
10240
4720
10532
13549
6919
3043
11407
10450
200
11882
7427
11230
16653
15836
14205
6519
4797
19629
13449
1815
7104
5188
10865
9178
3295
18487
4685
1368
10997
17634
15163
18577
10100
8913
11476
3873
14119
5172
18574
19759
2508
17320
9772
6013
9422
10686
14270
18425
10393
13667
20124
6156
17850
14303
6677
5687
9418
16535
14063
17114
3341
14862
8316
5475
11334
12057
5885
16312
453
19654
20507
5013
9463
9865
8893
15074
19457
17899
13753
14840
12253
7571
417
17473
13565
12241
19786
16773
16655
16086
13503
16032
15210
6724
11945
9067
2664
12026
8734
19792
7982
6803
10635
15875
18782
12622
9770
11860
7805
12936
16010
1660
3024
3069
16262
19520
21152
15004
3893
10957
8883
15352
7448
20717
14868
13085
15100
12757
1716
4166
11755
11773
12141
2087
16709
10815
17820
19354
17996
3652
16585
7212
20795
11922
17040
6148
14632
1719
1893
7118
18448
3778
3620
5424
18212
10339
20464
19766
16150
17514
14977
5850
18780
13358
18250
20354
17154
19955
14059
440
9552
8608
4938
1309
19972
17559
734
8289
8732
3940
19794
12257
5312
1354
10511
17456
192
4830
9718
7344
2396
7270
4149
7012
13706
9167
18004
14537
15997
9674
68
3660
15899
17405
8194
16456
15138
152
18005
8397
16643
20955
6507
772
3576
18126
20518
12508
19707
10376
755
3871
19375
2812
17005
9590
18202
20238
7139
18205
9596
9810
11784
13034
13758
715
20350
16367
16228
14250
8231
16951
13573
21168
4169
5665
7726
20268
14530
16876
14738
123
4682
16243
17204
10504
19443
16109
4925
5871
11470
18740
2948
7217
18811
270
6608
13669
12983
21086
13634
3889
6023
3027
19626
20400
8554
11645
16225
7248
15744
3533
19206
980
7244
15493
11421
5076
4096
14576
16470
18652
17274
19705
19286
15198
1571
13278
8081
10868
16574
5949
1366
19962
16853
6186
17453
6235
7545
19133
17305
1169
10922
9396
20730
8331
11910
15491
9322
20627
20755
13139
15449
19474
13087
10847
7356
19896
18996
16328
17392
20884
13918
18333
19465
8884
4060
18677
7735
16068
4264
6756
289
18837
12505
17807
16614
832
4119
10562
12561
3641
16541
9825
18597
10463
839
19220
14843
4294
5185
19209
8624
20158
10051
18764
6393
6835
11498
13938
10531
585
5155
10689
880
15994
18194
12755
9657
2578
691
18389
2772
17023
13262
18570
7081
1202
8949
9688
1424
19291
18443
7707
19113
16284
1751
19852
6741
7495
16127
4125
9799
18872
1944
7035
16294
3875
18829
7679
5477
11555
13817
7762
16509
9968
18693
10078
9307
9763
12394
8771
5092
7665
13324
16769
8415
9987
12305
10696
9269
13300
18080
2297
16889
10121
16305
2863
13425
20537
15495
17878
2104
5276
20478
14397
15782
18932
19431
19734
13717
9998
8993
11340
5940
15862
12844
2543
6033
17253
13470
2238
5365
3105
17629
13396
781
14778
19643
13682
15595
5269
8529
4815
7009
13931
2569
19961
6072
13906
15362
130
13406
938
1567
3199
17271
20119
17388
20192
14621
19337
4112
18695
1188
8147
12111
20503
6365
16622
422
4288
3906
5523
15116
15851
2632
14913
1705
12766
9344
7640
2066
13395
9027
5175
17591
4659
20982
8926
2996
2924
6666
17444
21042
13116
13173
16720
18498
3752
16074
13742
20923
21208
16664
4725
5296
7142
10563
14864
17602
9343
15944
13994
10387
9308
21120
9022
11415
6911
20972
2715
7391
16864
11919
8370
7549
4757
5112
18475
19237
6134
18572
6653
11253
20137
15182
6286
8347
10975
7080
8950
19138
13193
18391
3785
21182
3895
12520
16839
13124
5688
1869
327
14236
19
4555
3251
8324
18045
20692
16407
1531
277
9423
16394
6417
7053
20909
2503
5480
7897
20347
11350
1539
3182
4032
15105
20970
7552
13298
7268
10447
15951
15900
5028
11774
354
5342
6772
11770
2640
7912
20522
4613
12360
814
2686
7
4932
11646
13321
257
10866
14403
13989
10179
9286
6291
6491
9876
9909
20067
20401
7573
933
10894
20024
18127
3073
13546
17252
7677
19803
14770
8533
12157
18882
5639
10645
16163
20992
4931
2108
20235
18437
19282
18658
14051
18262
4873
11489
2036
11586
4057
595
9215
17775
15042
17638
17064
2086
15097
2089
18973
629
6596
3137
19283
5348
15666
1611
3861
15681
14488
15893
19180
8853
3110
16275
13460
6635
15897
13957
10325
2912
13218
462
16849
17949
18131
3119
13728
17070
9577
5003
16166
20759
15541
1708
1426
17057
13916
19560
944
14501
5745
1885
4473
10467
2095
1097
14848
14271
4648
19863
4531
10872
14985
16285
12566
9171
15166
20456
15172
5953
10845
9780
2411
16800
6456
13597
10459
6603
20333
4376
2213
3937
13152
19732
2554
8363
20833
19066
774
7388
1852
17408
11
5201
7133
14519
15340
11964
13956
19527
9488
17870
11787
14834
17168
10337
4122
1330
13194
7979
1474
17090
8881
18319
9689
10936
5444
5510
20441
20513
17178
3167
6649
6109
21172
8819
4819
13803
14094
20519
20572
10461
12162
14752
2738
10673
19632
20226
10557
8575
12184
16694
2219
11944
4563
16961
5599
16377
16955
5543
5743
19026
9698
3383
10374
7666
13420
20351
13198
3991
18562
17992
6142
10012
11292
14222
1642
9119
19607
4772
3910
8707
10565
143
3740
477
9861
20830
7508
10839
11946
17523
16263
15283
21106
17068
10126
11183
19019
9525
17198
6212
12049
2253
18301
20907
20580
12596
16308
17632
12369
3296
20549
3302
1841
5440
11080
8936
14545
807
20206
15511
17685
14764
16
17756
11439
14246
4752
11556
3963
14698
3859
5517
1636
4557
12750
5818
11531
2535
5917
15402
4923
7214
2171
12454
16057
7786
10943
10318
18986
16682
11684
1208
15878
16214
18954
20688
2836
12839
7563
12682
10019
6081
2321
1725
12036
9948
2413
5374
5592
17510
16015
20931
18924
6829
20200
19994
4664
11303
2978
17783
21009
19696
6634
4972
1881
7070
12448
14691
10243
6116
2656
8208
11211
19910
4382
17237
15174
3288
16335
9581
14285
14589
12903
19964
14744
4764
10707
7313
19481
17190
19624
8148
14873
7253
14745
12378
13925
15516
11391
4804
15305
4022
11874
6376
19189
16745
20935
16331
2445
5264
17572
8083
1687
9498
5359
9624
13016
13451
8536
9354
20059
18675
17731
2450
10197
17194
12287
7190
3748
8618
7326
10600
7974
19554
4095
6752
5782
9275
2824
10492
17010
11825
18332
12727
12734
13907
19599
4860
9635
12175
1020
1569
9504
16648
20932
8730
8726
15269
9389
14592
11824
14294
13947
14773
17798
11101
2078
18772
15313
2403
8120
0
14912
6595
6205
10933
16795
8423
15036
4081
19604
404
9882
12521
19749
8219
838
3213
4121
10559
19423
20983
2663
11842
16692
1584
452
20965
9182
15110
17955
19112
19773
19023
3391
17391
311
1840
15153
16568
4853
10190
3456
7307
13416
17407
9444
13596
16703
12455
10149
11588
9427
15220
19139
13610
15469
1517
1587
17215
20953
17684
17972
13979
9485
11332
19841
20097
11341
11895
12592
8900
3274
19013
2012
4015
15956
17744
14149
19548
1958
4866
8856
3840
16481
7579
6824
8005
3538
3178
2200
19532
19310
3286
16151
6128
7318
15537
16949
146
9170
8116
10362
7152
11000
5636
5082
1479
13154
2212
2821
6778
10163
8458
9595
11978
18216
12814
3842
13967
19540
13008
3715
9329
16612
16748
3125
20111
16177
1460
15312
21166
7748
20194
18833
21213
4427
13370
4263
12006
10105
15217
19758
6119
9690
19233
13616
9970
18655
6497
18088
18976
8988
21122
2654
19706
18913
16495
16337
18137
1947
5086
9202
20863
20694
2850
4881
12425
836
13238
14615
19695
21105
4811
928
14327
18627
20143
8498
12981
8965
5243
10613
17513
812
19998
11137
19593
9997
15896
5340
13935
2970
19755
21048
5976
8205
15002
3094
4046
11266
19167
11020
14651
12317
11202
12358
9619
1661
5490
13618
11647
16875
1357
10437
14931
346
7444
20152
20777
6315
6811
8107
4103
6380
6712
7461
16508
10794
1665
9788
4956
16211
10435
19144
641
20788
15880
4308
20016
20650
8048
14405
4303
15275
17900
18861
6943
13718
4070
17130
989
8663
13175
13429
19178
11640
3197
6173
3676
5232
1825
7918
12644
17933
1100
11715
2762
2977
2293
5050
8269
4253
21222
12087
13659
6849
9150
5116
11021
19523
18415
17577
9548
10142
3624
4713
14765
12924
10521
2998
14644
3208
10982
13404
16783
4968
3433
9538
14291
1837
2320
11962
21188
14547
17524
18230
19655
4400
20735
3776
19724
3152
14308
11062
19771
11001
12562
11090
52
13265
8756
20709
5202
19958
11092
7855
1635
8696
12053
1006
3823
8361
12514
9556
10640
14471
14571
19460
20207
6428
12430
14340
8389
21085
10299
13780
2415
7516
7543
11884
12587
18082
14099
747
15903
18537
9927
604
16445
6707
8692
20721
6760
18246
9592
9169
13772
4653
2677
1086
6913
18506
10312
16750
16901
7929
16196
16317
19729
16469
12971
8374
15635
15695
6886
8908
18643
16553
10921
883
19817
15801
11902
19221
13563
9316
20614
4076
9006
1151
18818
206
16632
19742
5672
19810
3301
7585
18098
19152
14213
16404
2369
9368
9890
15005
12011
2742
19920
20144
18752
15282
3353
14588
20256
261
5047
504
1096
6872
20677
4113
11791
4973
9155
19420
20063
4349
4234
17809
16139
17485
3008
381
4024
15214
20645
11007
1651
514
6047
745
228
3281
14198
1922
12054
19025
6823
20011
15139
17280
7116
16478
17315
20171
5716
1244
18898
15271
4451
3099
13458
2803
12020
14801
13231
16763
21060
2115
4870
11336
3029
3615
7757
11799
17708
13778
1747
8051
13890
9833
14685
1115
9093
7435
11449
14727
3162
6815
18225
4879
19329
4538
10759
13761
16123
3390
9870
18723
15985
3374
5006
19231
14711
14731
18427
18580
14080
3244
8345
20528
5135
11457
6676
12319
17594
11807
15982
18114
4415
11228
1218
18859
10702
5507
15236
16578
18378
10745
2286
20068
1564
3683
15663
16143
7646
3918
16792
19887
7660
19449
6695
9477
10379
12063
12957
11314
16231
149
19288
259
39
9325
12268
1811
16818
17767
18079
6421
9071
9428
14036
4665
15557
7827
12348
12154
393
7178
10636
19692
11516
5283
13681
18949
12652
10831
4794
892
8972
5314
1038
12311
15623
7387
10410
7336
8042
9065
9207
10222
17445
14634
16545
17742
2006
4735
11119
18540
6302
10651
21196
15863
17770
17902
17908
6069
7908
13062
11269
16096
3631
5254
11051
6431
7988
9710
13125
14579
14533
18375
19484
5625
8760
19448
20317
20425
8053
16528
19245
486
13028
13151
8933
990
4375
1504
20085
4290
2409
8515
14089
14583
1050
1475
1277
1148
13580
9739
11802
18816
21028
7673
2154
9863
9084
13386
18071
20621
3297
8720
2979
7894
19072
5843
9004
11469
7314
12421
14817
1580
17149
18703
3461
4027
5117
2045
11814
6742
17719
8227
10007
16749
4274
7328
13106
12116
12363
10820
13905
4352
10106
3400
8390
14220
18845
20625
14490
19182
16250
16629
17127
18530
20608
12532
922
1389
20811
966
8012
11134
14072
3726
11692
1209
17702
8962
6905
765
2817
8683
1117
15142
6435
10004
15476
15752
13393
15228
15257
18317
18904
18295
810
9762
8332
8703
1521
11843
11995
17884
19835
941
10823
17976
7688
8671
9297
19475
89
4736
608
12663
9992
4355
6571
6766
14206
15779
3645
16702
366
9540
20038
2127
111
12542
5147
5356
8114
4153
9914
4391
13704
14608
17593
6570
17009
10756
16162
7843
12690
18388
19433
14357
2130
6716
19411
18069
13247
17414
4519
17857
20973
8799
15531
5204
7250
8085
10333
12848
10714
17794
3757
15789
12108
2556
17556
19230
3498
9472
1551
6974
16033
13798
13934
16160
5287
7970
15837
13662
17613
18805
2195
6944
1009
12015
13183
6779
8228
3640
8495
9783
10685
9294
10239
6202
9622
12503
20646
3603
7709
18083
4354
728
9749
18163
4789
18777
15586
20272
568
8906
12048
19305
3156
713
14135
18795
2268
435
11144
17618
7179
3916
4512
6176
15464
19455
6927
139
5208
8497
11864
12608
769
13922
14278
3658
3828
8322
20028
213
17200
5931
10129
10185
11451
19882
3521
11453
15806
15924
11330
12270
11838
13594
3331
9643
19444
20662
9847
2938
19333
13560
15407
1877
20630
12563
14079
9613
10638
6441
10895
12665
1325
2867
4178
10711
20729
3255
10899
3266
10634
12431
16790
454
11145
5565
9569
12214
18479
5125
12944
20964
13033
6483
11410
13762
21070
13615
13813
19717
20946
2674
10590
16581
18486
19997
3034
10382
12055
14916
1761
18214
3006
8980
9319
11339
15218
18099
731
6689
20431
5317
8676
9835
10064
1777
13531
4805
4841
15039
20136
20415
5534
5597
13384
6802
17790
20719
1133
12126
10359
4010
407
722
14733
15248
16995
11920
12908
15938
20601
5573
11078
1618
3443
694
8210
20570
9232
11867
20708
2196
6865
16128
7796
8903
9390
11584
11670
17542
6793
911
13055
20786
3434
12269
14833
17434
15739
16542
11601
8481
7522
7849
2530
2705
5859
8796
15310
20349
3070
9347
8504
15343
16095
4116
2528
12312
12965
13526
1832
19440
2724
7407
8226
10071
14825
11655
12061
14387
6960
7951
11595
19141
19469
3211
6386
19503
19973
4260
11374
3759
7833
905
13509
15064
16323
20532
4048
13578
9080
2226
11461
15784
18961
20328
3426
557
12701
14877
15276
16197
5010
9445
15572
2893
3415
7550
8753
9549
99
13633
20164
5532
9745
127
2895
3863
10495
5194
5875
8786
9135
5417
5699
8367
18140
19242
319
9649
3968
5964
14190
13260
5881
8298
8494
13695
15455
20774
4110
4680
8381
8834
1501
18136
16488
19244
14041
1724
9448
16378
2173
8644
17469
1940
3059
4917
5399
541
21006
6705
13035
11629
12553
15767
1259
449
12462
18827
15714
16340
17507
6095
8024
10470
11899
5960
12156
1326
17846
19238
2524
10956
11529
12350
15958
8267
17837
18168
4258
56
12860
9338
5801
639
15232
17855
8943
9641
12878
5495
9962
11338
11414
12405
14317
17134
17944
19840
12507
11512
17701
19467
6362
17066
17581
554
6931
15719
19943
18012
18361
1846
19684
12449
2469
826
2251
4278
4806
889
18647
4800
7831
20357
4577
14660
9285
2446
3275
6145
6652
7592
15939
17476
1809
11399
6395
13029
16315
15725
17026
5345
7487
13134
14883
16439
18135
21083
6446
1083
20128
8271
8687
17336
18346
3316
12728
12792
175
54
5685
601
17835
19404
20424
2278
2722
778
21211
19001
13122
16349
18147
2142
2306
1775
21171
7219
2693
2733
4443
18460
19600
2628
12791
15590
16272
17665
4093
5187
7782
8011
13250
17824
18839
6578
7598
13153
14988
15073
15154
2670
2673
27
7765
10394
1114
11441
14741
2295
4173
9977
11219
11520
3949
11731
12286
18800
3335
6270
11220
12393
14759
386
4916
15773
16427
17776
20381
4990
1497
19690
7811
11130
14981
18880
20182
3795
11658
15821
19268
4460
11830
13367
15934
16261
18586
19859
4309
955
5518
697
11296
11861
14221
15583
16762
1844
4280
2889
3573
3590
7041
12075
18264
5657
11870
16099
18583
18788
5632
8831
94
11943
15716
1887
19913
8650
8983
19723
5228
12527
12641
13972
18754
2597
7830
9457
3801
7689
7864
1186
11940
17124
17898
19059
4181
9953
12937
1669
18993
14084
7535
9030
19232
2356
4715
10273
1082
12658
16185
7366
7367
9203
1280
7302
10040
11669
12726
3384
6021
1205
1423
1620
16373
4559
4820
8301
14174
15984
16213
17966
3837
4041
7229
865
11473
17369
2511
5422
8598
10345
10515
12066
18018
20769
4357
6004
11708
10206
1387
16193
17352
20049
2062
14739
15285
18922
12718
13849
14876
15199
15364
16649
20240
20910
9946
12735
13316
13562
18794
7538
13794
15962
17730
7237
10342
12433
15192
15676
157
3153
4329
4518
5730
7443
9495
1520
2723
3405
7410
17424
12602
13376
642
16757
2616
5904
12646
13952
14577
7264
7652
8134
8565
1786
18220
19438
3140
7114
8712
10796
14552
1615
19018
19568
13318
13545
14082
15693
5474
9192
9980
14511
598
10534
10859
10960
14029
15710
19115
19186
20495
2844
1241
15379
16735
17374
2153
6106
145
15879
18979
8260
1690
18178
2302
3531
5186
5324
5862
195
19870
20157
6406
7298
9147
10809
15811
17999
20339
2560
10821
12388
14071
14641
15771
16704
17540
1302
15605
16420
6233
18122
6547
13814
3496
405
4235
6228
8520
1002
16090
16270
19516
2825
6890
9578
11760
12828
14074
18242
3240
6246
11720
17079
17943
20218
4177
6150
9055
12404
14121
1664
17355
4002
71
7754
10074
2545
6010
794
1421
2080
21133
10668
12629
2331
2648
2960
3710
821
9296
1227
13412
20517
3095
10558
10655
1154
14379
16698
18564
3537
13646
13709
15802
18259
18930
6750
20165
21197
2595
5766
8791
10540
1074
1225
20293
2493
3215
7417
8969
11561
12016
19885
20919
7025
11949
15022
16204
19634
20942
4701
6553
1172
14857
17969
18713
10510
10932
12419
14729
16693
19000
10998
11891
14388
14692
15092
15869
16236
16886
16941
2790
3607
4625
10880
11102
12273
12875
13987
15653
15857
18522
4064
5750
10682
15189
15381
15861
19147
20695
9509
14958
17539
13127
135
18254
18532
20911
3601
3674
467
5288
7258
7678
16156
16669
2134
4849
9468
10852
16014
16921
17139
17181
17410
20253
2229
11162
13381
13927
19060
20385
2787
3665
4536
860
1081
12490
13645
20147
2707
4549
8564
8606
10278
10856
11913
15307
16307
16747
21186
2308
6432
8234
9758
11984
13497
13963
15895
4085
5748
7304
7986
9385
9791
9897
10307
11156
13846
14344
19601
205
21037
725
8635
2792
3556
5246
10096
12880
13264
14774
15035
18888
20023
20857
5080
565
6257
8643
8978
104
3246
8399
8665
8781
11747
12284
14011
16266
17400
3604
3899
9790
15966
17203
3072
4986
5141
820
8858
10818
13320
15149
16352
19153
21174
5341
7315
12446
12765
14497
14609
14814
15272
5957
6936
7555
8187
9241
10966
15496
16549
19989
20295
20327
20599
4186
475
478
4896
7386
864
9566
12815
12988
15505
10360
13715
15120
15835
179
18747
4978
8704
9035
11801
13192
15346
18918
19925
8350
8735
107
12683
13294
13970
16616
17822
3891
4857
7046
888
10289
13423
16287
17053
18291
7373
9040
12090
15441
15917
1823
18504
20212
4136
7890
8882
8977
3349
4671
6307
7286
9130
9377
10611
1203
1499
1667
344
5375
9820
14763
1774
17829
18167
18947
19299
2022
5081
7021
8869
10934
11164
11998
13230
15016
19255
19493
2452
2676
7119
770
8522
9960
11348
11563
11651
17042
172
17658
20370
981
1273
14911
16582
17165
18688
1872
19796
20682
2221
4821
5693
5719
6083
6573
6654
6787
1183
1222
19804
20281
2544
4038
5410
11229
12456
12818
13559
15266
16791
3725
4276
5621
9489
1226
14106
14161
16359
1700
19862
19981
3163
3170
3488
4763
5578
7783
7846
10950
12614
14900
1589
1882
19661
3091
5525
7914
12301
12402
13001
16460
16499
17603
18058
1950
19797
3599
4058
4998
8697
932
14086
14920
18256
19546
3789
5151
11402
11929
12390
13083
1518
16758
17517
17766
19207
19410
2925
4497
4697
6065
6188
7134
12224
13630
15311
16135
16208
1772
2521
9636
114
12397
12645
14993
16576
16668
17191
20892
3483
6198
8008
8545
9687
12194
13884
1400
17174
4133
4344
4635
5795
9573
10157
12285
14832
1614
16910
18685
2103
742
1026
12675
13432
13722
14897
15960
17421
18650
21032
3802
5559
6442
707
9796
10305
11316
15219
16031
18040
19057
19645
2098
284
4551
5063
5472
8376
9455
12777
19511
2138
6454
8961
9470
10801
11070
13475
14945
1796
1821
20096
20548
20738
21147
2263
3464
4527
5062
5313
851
8970
9049
11823
12929
16006
17875
18081
19321
3883
4599
5209
5921
5983
6400
7617
11151
12512
12879
13611
15957
1641
17795
19422
350
7874
8262
1315
1393
14168
15412
19579
20276
2351
3882
3934
5461
764
9388
9904
1283
13836
14611
15490
15499
19028
19205
2697
3770
4161
5064
6058
7097
8512
10139
10460
11604
18792
3854
4636
4964
4987
5681
7958
8182
8525
924
9274
10196
12391
1351
15741
1634
16809
2215
4946
8119
8192
9801
1206
13197
17903
18001
3670
4852
7204
7222
7609
801
8121
8780
8909
11283
11871
13133
13585
13939
14299
14826
15533
17016
17260
17351
18031
18193
21072
21159
2390
2491
263
3074
3113
3225
3557
6220
6464
6567
7865
1892
19149
19580
19659
20056
20139
3237
7110
8065
11074
11906
13100
14402
14653
16325
18231
18550
19873
19892
20913
5244
6621
7059
7807
8896
9867
12206
17082
17839
18750
2843
4405
7210
7234
8699
9219
12216
12321
12633
13241
13701
15722
15959
17431
1867
3743
6208
7558
10924
14489
15049
2373
3467
4322
4910
7331
746
754
10166
13289
13295
13307
18418
18419
216
2527
2744
2884
3104
4371
6591
8022
8318
835
9299
11147
12400
13581
13820
14802
14967
15847
161
16397
1763
191
21061
2218
226
2272
4242
4619
8422
10566
10667
12088
14024
14075
14990
15056
16136
16583
16761
16998
17447
18870
20042
20686
2467
2534
3124
5456
6125
6332
7163
7425
7445
7923
8101
11465
1324
13334
17639
20585
21000
3151
3396
3941
5073
5447
6743
852
9617
11037
11926
12481
13527
14865
15772
16724
1870
18897
19095
20948
4687
4696
6455
8611
9191
10340
11113
12439
12925
14097
14800
15479
16690
1695
18760
18927
19521
20773
2875
33
5106
6771
9116
10918
11120
12149
16487
16589
18115
20125
21088
6266
7566
9898
13044
13716
1374
14155
14184
14356
15948
17244
18546
20029
20051
20642
2146
6113
7091
7738
8235
8245
9002
13107
1355
14543
16765
17056
1730
19361
20864
21020
2468
3146
3190
4227
547
6076
6875
8486
8623
9359
15112
15768
17261
17342
17734
18164
18527
19345
3727
3942
5876
7520
7618
7777
795
8490
8668
8728
8939
1138
11836
12889
15723
1577
18601
18903
19430
19501
19663
20149
20981
3407
4332
4567
528
7037
8069
8807
8851
8931
9100
9321
9995
10331
10964
13032
13202
15425
18207
19300
19308
19437
2917
3509
399
4
4337
4610
4951
5289
6288
6557
7922
8159
8212
9106
9206
9379
9528
9786
10020
11423
1144
1468
15144
15488
16621
17307
1899
19118
20801
227
2339
2458
251
2581
3051
3066
3096
4828
5248
6342
6819
8089
855
9372
10151
11104
11525
12300
14381
14389
15931
16421
1666
1954
2018
2190
313
4514
4802
4904
5297
5873
7374
8328
10094
10726
10734
12554
12639
12669
12790
1341
13410
1359
15703
16117
16756
17737
17906
19271
19693
2496
2596
5110
5732
614
70
8308
8438
8737
8947
9132
10110
11364
11776
12067
12543
12891
13748
14823
15554
15617
16502
167
17088
18192
18491
19319
19848
20013
2005
20526
2833
2907
3529
6451
704
7084
753
9138
11901
13251
13331
14067
14263
16517
17368
18396
21109
2303
2353
5235
566
6146
6782
7355
8096
8312
8527
935
9430
10688
10876
11238
11615
12952
13024
13047
14167
14561
14663
1507
15336
15987
16411
16657
17167
1744
18696
21134
21191
275
3089
5686
6374
7200
797
8359
10287
10728
11649
12977
16433
18075
18678
19086
20287
20853
20933
21179
2166
4521
5831
6241
6354
6532
7572
9264
9877
11535
11976
12670
12802
17762
1979
20022
20576
20980
21017
2255
2506
3779
3800
4135
5079
5999
6683
8894
9871
10154
11925
13901
17180
17661
17739
1779
18338
19743
20754
2740
4283
5977
6158
6261
7001
8997
9198
9760
11497
11820
131
14151
14194
14256
16516
16787
17071
17371
17670
18074
18321
18431
18440
18464
20344
2394
3358
3637
3761
4433
5552
6064
6082
6259
6368
7036
8783
8963
10371
105
10812
1548
16443
16666
18383
1879
19031
19680
20430
20610
2204
2382
2739
3233
3330
3628
4446
4694
5066
515
6014
7485
7530
8155
10084
10227
10784
10862
1125
11307
12857
12886
13282
13754
1471
14927
16265
16930
17397
18281
18531
19791
20974
3346
337
3925
4501
6118
6194
644
6797
6904
9494
11243
12338
13364
13454
13730
13739
14554
14809
14899
15621
15792
15926
1652
16630
16726
17107
18497
18841
19396
19605
20075
20889
21148
3040
3293
4165
469
6267
7353
8457
8499
9821
10232
11957
12022
16269
18844
1888
19063
19822
19906
20434
5184
5807
6155
7220
7284
7645
9400
9484
9956
10176
10245
11097
11127
11210
12109
12201
1256
14015
14124
14386
14423
14578
1477
15204
17038
17163
17426
19428
2002
20367
20486
20512
20655
20766
3106
328
3681
618
6450
6489
6545
6664
7260
727
7466
7594
7753
7819
8100
8886
8992
9474
11983
1486
16442
17819
18123
18745
18796
19009
19106
20210
20506
3750
4705
5123
5210
5402
5994
6420
6503
6638
729
8166
8758
8798
9168
9237
9413
10169
10505
11762
12247
13054
1381
13832
14043
15255
15420
15564
18336
18883
18889
20197
21149
3175
3254
351
383
387
3903
4005
4039
4825
5290
5370
6218
6917
6955
7957
8329
10448
10687
11227
12212
12235
12432
13276
14017
14260
15303
15911
16548
1746
18095
1851
20043
20228
20455
2423
2944
6392
6998
7614
7720
8293
8310
8323
9078
10101
10439
10892
12719
13421
14073
14616
15790
15800
15853
1609
17073
17147
18671
19177
19660
19787
19854
20140
2020
20718
20720
20791
211
2265
3317
3364
3393
4373
6370
6469
6517
665
7029
733
7729
8784
9759
9823
9991
10475
11064
11258
11585
11706
1175
12229
12271
12428
13052
13222
14105
14311
14886
15459
16296
16779
18549
20320
2879
3432
3995
4516
5530
6232
653
6928
7108
7503
7877
8914
9200
9542
10187
10780
11044
11049
11528
11835
1238
13011
1333
13660
13880
14335
16000
16114
17573
18035
18465
18579
20232
20698
20990
2777
3694
4468
4884
5336
5386
5814
6281
6518
6637
7285
7480
9073
12038
12549
12793
13252
13290
13337
13872
14111
14297
1461
1463
14852
16430
16785
17195
1728
18245
18302
19217
19954
20490
20551
21111
2737
3836
3956
4351
4738
5501
5514
587
630
655
656
658
6900
8062
8519
8990
9352
9541
9869
10917
11259
1127
11480
11502
1156
11745
12365
12575
12689
12694
12949
142
14406
15006
15245
15581
15829
15992
16191
16896
17318
1783
17873
17979
18402
18416
19363
20142
20361
20443
20536
20563
21087
2542
3021
355
375
388
4115
4915
540
5803
6215
6359
6430
7624
8825
9038
9246
10776
11575
1164
12945
13240
13637
14139
14267
15314
15659
16048
16146
17356
18557
18963
19698
19953
20196
2719
4033
4341
4611
5310
5451
638
7075
735
7792
8543
8708

10058
10443
11294
12198
12371
13215
13691
13893
14276
14426
14473
16292
16700
16736
16835
17278
17538
1792
18390
18392
18420
19125
19236
19246
1936
20004
2004
20334
20394
20908
21169
2407
2420
3065
4299
5070
5349
548
6251
6660
6693
7066
7107
7238
7402
7608
8136
8236
8300
8439
8562
867
9615
9633
10033
10484
10519
10984
11234
11627
12862
14549
14754
1487
15299
16251
16695
16918
17106
17169
17604
18188
18229
19265
1928
2029
21102
22
2299
2829
3077
4958
5109
5684
5742
6472
6678
6696
6726
7422
7712
803
8102
8117
8401
8482
9972
10006
10067
10172
10202
10321
11129
11907
11950
12027
12231
1234
12528
1296
13037
13103
13764
15046
15522
1575
16482
16619
16996
17321
17625
17774
17862
17995
18062
18258
18352
18843
18951
19032
19338
19343
19949
20260
2501
339
3634
3765
4105
5465
564
5764
6020
6415
6558
6690
7055
752
7527
7817
8667
8845
9016
916
9663
9777
9803
9971
10056
10311
10849
11523
11590
11753
12274
12434
12510
12556
12720
13225
14003
14042
1441
15548
15770
1638
16562
16926
17133
17299
17780
1787
18162
18181
18441
18611
18895
19267
1929
20000
2137
2669
2783
2942
3064
3242
3247
3623
4199
4345
4759
5074
5247
5673
5765
5993
645
6881
7054
7972
8339
917
9735
9753
10171
10344
10402
10543
10885
11226
11868
12021
12136
12585
12973
13070
13072
1314
13508
13944
14445
14885
15156
15247
15701
15803
15834
15954
1624
16240
16333
16804
16917
17329
17668
17676
18046
18408
18421
18500
18944
1975
20159
20371
20657
20762
21026
21058
3280
3298
349
370
3707
428
4542
4650
4831
4920
5284
530
5352
563
6544
6616
6627
668
6813
7266
7341
7732
7883
8335
8700
9223
9594
10195
10208
10277
10723
10968
1131
11521
11758
1185
12189
1221
12236
12341
1248
1399
14076
14751
15062
15175
16161
16245
16403
16909
17037
17179
17358
17396
18299
18892
189
18907
19492
19606
19611
19884
201
20407
20481
20632
20663
2156
2612
2623
2918
3207
3261
3325
340
3618
4040
4082
4498
4552
4865
5275
5303
5459
551
6899
7126
7540
7559
8850
9189
9317
9415
10021
101
10367
11408
11959
12573
1290
13452
13463
13498
13747
13777
13881
14007
14354
14597
14699
14730
15044
15634
15894
15904
16091
16837
17018
17877
18017
18052
18244
1875
19010
19318
19364
19505
19666
19947
20104
20432
20567
20825
20914
21104
21192
242
2815
3035
3053
3090
359
3764
4782
5034
5542
5886
6411
6918
7089
7109
7604
8060
856
8600
8870
9397
9558
9648
10162
10209
11293
11805
12346
12447
12483
12491
12498
1265
12803
12810
13126
13450
1370
13840
13949
13962
1427
1429
14603
14776
14813
1484
14955
14964
15631
16013
17069
17157
17844
18664
18698
19044
19058
19764
20543
20905
20987
2112
21143
2590
3739
40
4620
4955
4962
5326
5416
5476
5773
5825
5915
6275
673
6965
7275
736
7714
7946
8003
8049
8450
85
8566
8658
8899
902
9363
9681
9986
10153
10168
10502
10875
10911
11321
11375
13352
13485
13515
13732
13793
13827
14188
14275
15008
15099
15337
15442
1579
15819
16216
16448
16563
16734
17375
17868
18161
18680
19273
19519
19911
20395
20748
21064
21185
2133
3078
3230
3696
4051
4367
4401
4484
4898
5128
5182
5196
5419
5570
6510
7291
7325
7381
7564
7815
7836
789
7948
7960
8198
849
8629
8741
9018
9137
919
9313
9502
10319
10375
10568
11035
11844
12143
12713
13408
13555
13617
13809
1412
14154
14639
14710
14972
15169
15327
15943
16360
16511
1757
17895
17968
1799
18209
18273
20457
20498
20510
20606
20638
21021
2178
2505
2831
2870
3102
3493
3902
4159
4286
4431
4762
5178
5358
5398
5429
5580
5650
5758
5794
5914
6391
6413
6508
6537
674
6945
7517
7582
7653
8063
8109
8139
8327
8508
8855
8966
9394
9587
10286
1034
10350
10781
11897
11955
12809
13113
13233
1334
1349
13628
13818
13885
13974
13977
1403
14382
144
14928
15115
15253
15905
16319
16774
17273
17335
17498
1778
17852
18
18021
18105
18170
18217
18240
18287
1862
18681
1921
19986
19990
19993
20345
20658
20807
21029
2484
2594
2842
3196
3502
3571
3664
385
4335
471
4991
5039
5159
5321
5355
5988
6108
6617
6867
7357
7774
7900
8729
9320
9520
9964
10034
10102
10514
10785
12536
12678
12730
13111
14411
15787
15818
15907
16221
16838
17558
17942
17977
18061
18182
18667
18960
18972
19050
19098
19462
19463
19621
19945
20025
20598
21175
2216
276
3039
3054
3058
3361
3413
3506
3671
377
3931
3944
4170
4222
4268
4823
492
5464
5645
5727
5963
6424
6784
6924
7242
7303
7457
7505
7536
7717
8398
8480
8561
8622
8878
9194
9366
9526
9797
995
9973
10414
10652
10725
11175
11279
11349
11481
11797
11850
12205
12248
1231
12342
12395
12732
12845
12921
13207
13456
1350
13567
13583
13613
13874
13892
13911
14116
1449
1458
14602
14682
14982
15357
15643
15750
1593
16249
16303
16361
16741
16963
1704
17054
17881
18151
18224
18694
1924
19280
19380
19495
19701
20409
20473
20534
20553
20574
20637
20676
20838
21217
2287
2706
2784
324
3378
3404
3451
384
4031
4162
4297
4359
4397
4839
5144
552
5544
5637
5689
5692
576
6296
6759
6885
6926
6934
7006
7071
7187
7470
7589
7898
8018
8207
8259
8326
8436
8645
8655
8871
9059
9197
9245
9464
9899
10009
10308
10708
10739
10913
11002
11008
11587
11672
11683
12290
12668
13234
13486
13995
14117
14337
14347
14457
14458
14509
14687
14863
14881
15113
15150
15250
15360
15440
15494
15589
15685
15826
15906
16462
16484
1672
16856
16903
17012
17419
17526
17584
18261
18296
18912
19176
20041
20280
20297
20781
20925
20934
210
21114
21218
2205
2371
2474
2476
2488
3334
3438
3585
3755
3766
4018
4147
4262
4448
4993
5134
555
5709
5725
6027
6580
6948
7562
7655
7730
7838
7856
7872
7880
817
8184
846
8599
86
8782
8898
918
9284
9440
9798
9868
10031
10314
10680
10715
10737
10795
10909
10988
11045
11286
11513
11855
1192
12322
12461
1267
12986
13071
13074
13894
13900
14186
14235
14342
14418
14453
14539
1473
15013
15162
15368
15378
15444
15809
16039
16525
16564
16641
16836
16891
16994
17482
17617
17941
17948
17952
17954
17962
1805
18311
18502
18842
18855
1903
19045
19143
19325
19633
19809
20089
20289
2030
20335
20491
20545
20702
20772
20880
20988
21099
21119
215
2290
2599
307
3075
3347
3554
3636
3698
3998
4154
4326
4377
483
5265
5307
5609
5615
5738
631
6409
6855
686
6942
6952
703
7352
7416
7534
7606
8185
8264
8357
8449
8463
8837
8955
9188
9814
9822
9842
9934
10282
10348
10527
10804
1095
10981
11272
1140
11539
11569
1165
11923
11953
11987
12113
12293
12296
12367
12407
12767
1289
1301
1320
13212
13446
13447
13917
14026
14160
14333
14613
14628
15000
15024
15107
15143
15361
16097
16244
1662
16627
16711
16780
16798
17232
17239
17293
18043
18154
18761
18821
18832
19069
19314
19395
19518
19555
19718
1994
20008
20117
20386
2040
20504
20712
20993
2327
2341
2412
2478
2583
2793
3180
338
3551
3685
4565
4608
4628
4676
4827
4930
5033
5118
5387
5431
5554
5596
561
5735
5752
5817
5867
5869
5947
6097
6141
6159
6324
6847
6861
6862
6933
6989
7045
7185
7471
7625
7808
7871
8265
842
8434
8666
8827
9011
9282
9304
9691
9978
10001
1017
10220
10335
10353
10471
1066
10709
10731
10735
10743
10802
11087
11125
11152
1121
1122
11267
1141
11466
1153
11711
11809
12132
12208
12265
12460
12598
12685
12854
12895
13169
13227
13237
13253
13312
13766
13796
13812
14339
14364
1446
14573
14598
15419
15539
15970
16279
16334
16382
16409
16544
16676
16770
1678
16990
17052
17214
17376
17382
17394
17590
17865
18116
18189
18435
18606
18654
18751
18809
18935
18936
1927
19349
19490
19510
20034
2017
2024
20389
20399
2061
20775
20820
20835
20852
20873
20943
21116
21162
2176
2388
2472
2509
2627
2769
2901
2904
294
3013
3270
334
3406
3648
367
3688
37
4006
4053
409
4102
4148
4384
4479
5030
5148
5230
5240
534
5455
550
5723
5855
5937
6100
6154
6404
6506
6509
66
7295
7524
759
7680
7893
7926
7947
808
8362
8594
8754
8849
908
9103
9213
9216
9222
9586
9640
9702
9711
9838
9938
10045
10391
10409
10542
10614
10942
10978
1137
11429
11608
11763
1190
12078
12174
12259
12340
12637
12684
12852
12900
1300
13017
13042
13118
13209
1338
13461
13676
13797
13908
14108
14217
14439
14443
14550
14559
14891
14905
14926
151
15129
15472
15613
15972
16134
16290
16557
16989
17212
17282
17343
17451
17548
17726
18169
18735
19254
19372
19435
1967
19700
19722
19891
19940
2000
20084
20087
20133
202
20377
20471
2056
20597
2060
20631
20810
20904
20944
21073
21076
2271
2421
2622
2653
2708
2785
2809
3329
3392
3428
3542
389
3932
3972
3984
3994
4129
418
4187
4348
4358
4587
4647
4675
4761
4775
48
4950
5019
5174
5212
5351
5376
5590
577
5922
6175
6179
6206
6515
6589
6605
6731
675
6783
6788
6795
6796
6864
7023
7138
7385
7699
8282
837
8454
8556
8603
8627
87
90
9026
9044
9131
9365
9424
972
10164
10238
10458
10700
10732
10843
10889
11223
11315
11392
11427
11440
11462
11510
11573
11597
11619
11676
11739
11905
12032
12051
12225
12453
12548
12656
12771
12820
1291
13112
13213
13216
13226
13357
13622
13656
13752
13891
14173
14178
14500
14563
14697
14786
14849
14892
14932
15201
1537
15399
15448
15544
15654
15665
1574
15766
16170
16187
16209
16252
16280
16365
16592
16599
16667
16729
16932
16954
1698
17117
1720
17201
17300
17340
17450
17511
17672
17696
17728
17845
17918
1795
1797
18176
18366
18539
18565
18573
18615
18668
18749
18831
18933
19002
19137
1943
19442
19471
19748
19751
19777
19820
19922
20185
20438
20461
20474
20493
2050
20571
20778
21033
21036
21054
21079
21123
217
2307
246
2475
2549
2562
2610
2806
2838
2865
2968
2994
315
3172
3276
3311
3314
3369
3527
3741
3848
3990
4068
4424
4486
4895
5037
5055
5124
5130
5180
5199
5282
5433
5569
6031
606
6295
6323
6328
6355
6358
6490
6527
6536
6579
660
6629
67
6800
6935
7016
7099
7209
7223
7390
7546
7568
758
761
7619
7676
7698
7719
792
7939
798
7998
8007
8045
8066
831
8380
8431
8589
8656
8677
8802
881
8865
901
9493
9544
9564
9671
9714
975
9773
9813
9926
10066
10097
10108
10436
10916
11048
11095
11131
11280
11297
1136
11362
1150
11526
11550
11618
11681
11829
11916
11956
12074
1211
12153
1243
12457
12567
12580
12600
12763
1282
1298
13137
13292
13505
13605
14028
14040
1413
14131
14150
14189
14210
14655
14678
14819
1490
15185
15223
15328
15392
15530
15664
15721
15780
1588
16380
16573
16602
16766
16823
17112
17172
17367
17373
17566
17669
17746
17889
17901
18078
18145
18417
18468
18472
18478
18533
18556
18644
18697
19038
19096
19145
1926
19533
19575
19704
19711
20065
20184
20214
20337
20467
20558
20578
20671
20845
20885
20888
20896
20960
21095
2259
2301
2386
2589
2602
2684
2766
2846
3030
3055
3103
3149
3241
3417
3606
3818
4179
4232
4233
4461
4885
5087
5088
5334
543
5473
5606
5804
5824
5968
600
6289
6311
6438
652
6727
6912
6962
6982
7103
7233
7324
7474
7746
7775
7919
8161
8372
8451
8493
8559
874
8774
8864
8879
8890
8901
8953
9048
9090
92
9212
9287
9288
9324
9331
9356
9384
9431
945
9539
9618
9672
9682
9738
9756
9794
10119
10128
1018
10271
10274
10380
10423
10433
10434
10499
10509
10581
10629
10721
10766
11201
11237
11282
11643
1179
11817
11970
12040
12095
1217
12188
12277
12288
1235
12398
12409
12624
12672
12704
12741
12966
13099
13144
13178
1331
1339
13397
13401
13621
13683
13768
13807
1382
13869
14103
14159
14176
14241
14269
14438
14482
14510
14619
14665
14725
14787
14861
14898
15057
15095
15123
15146
15203
15229
15241
15351
1540
15434
15450
15536
15660
15743
15763
15830
15842
15858
15961
1599
15998
1601
16310
16370
16437
16451
16461
16465
16638
16743
16813
16981
17001
17231
17236
17277
17288
17317
17462
17503
17757
17778
17840
17946
17974
18023
1808
18404
18476
18608
18676
18774
18877
18899
18939
19088
1912
19136
19173
1923
19405
1957
19688
19799
19839
19849
1987
19926
20003
20153
20188
20205
20294
2033
20392
20405
20447
20458
20530
20533
20538
20771
20784
20844
20854
21193
2123
2316
2429
2502
2666
2780
279
2794
2845
2919
3117
3159
3245
34
3401
341
3477
348
3561
358
3584
3639
3975
4023
424
4327
4438
4458
4596
460
4612
491
4914
4966
4977
5044
5059
5061
5167
5251
5274
5286
5347
5392
5421
5449
5482
5535
5608
5700
5726
5746
5943
5978
5992
6053
6169
6476
6577
7011
7052
724
7256
7263
7267
7297
7321
7327
7375
7393
7496
7514
7537
7560
7602
7711
7734
8082
8098
815
8232
8369
8555
8577
8593
8695
8722
893
9025
9057
9114
9289
9459
9491
9658
969
985
9858
988
9924
9929
9944
9965
1001
10218
10260
10275
10310
10329
10488
10493
1052
10539
10646
10834
1084
1108
11371
1139
11448
11571
11572
11705
11852
11939
12191
12221
12258
12334
12352
12401
1261
12729
13057
13063
13115
13138
13182
13187
13405
1344
13675
1372
13740
13790
13824
13864
13985
14016
14066
14122
14314
14369
1442
14512
14570
14593
14624
14694
15003
15075
15191
15237
15265
15292
15680
15730
15778
15786
15909
15919
16025
16094
16165
1621
16210
16413
1675
16855
16916
16982
16985
17247
17270
17303
17495
17554
17563
1764
1789
17892
17925
17991
17994
18143
18190
18213
18315
1833
18516
18534
18588
18738
18756
18846
18879
19047
19327
19526
19589
19614
19855
19869
19874
19967
20021
20055
20078
20116
203
20403
20416
20459
20462
20626
20744
2079
2096
21018
21136
2120
2141
2194
2368
237
2387
2471
25
2564
2718
2854
2858
2921
2963
3004
3093
3206
3315
3436
3550
3699
3792
3879
3892
4069
4152
419
44
4447
4459
4638
4660
4760
4787
4835
4982
5346
535
5364
5783
5833
5835
5926
6029
6085
6149
616
6178
6675
6767
6937
7004
7005
7095
7150
76
7736
7891
7913
7961
7978
8016
8046
8091
8170
8221
8237
8348
8607
8636
8749
8779
8826
9069
9151
9205
9235
9255
926
9337
9419
9454
9516
9598
9611
9662
9746
9841
9883
9892
9974
10028
10046
10112
10130
10131
10182
10280
10295
10327
10358
10373
10417
10567
10574
10612
10653
10676
10681
10722
10778
10779
10887
10896
10929
1099
11054
11058
1106
11063
11076
11141
11163
11262
11285
11416
1145
11463
11492
1157
11574
11606
11641
11665
11722
11729
1174
11788
11827
1187
1197
12045
12152
12192
12197
12199
12217
12260
12345
12408
12436
12438
1247
12485
12506
12625
12650
1270
12709
12738
12770
12893
12907
12920
12950
12953
12959
12996
13005
13012
13174
13344
13349
13350
13380
13478
13522
13557
13566
13572
13625
13687
13738
13763
13769
13816
13883
13896
13943
14
14179
14234
14238
14380
14399
14420
14444
14470
14505
14600
14700
14707
1472
14758
14781
14827
1483
14835
14853
14856
14866
14872
14929
14941
15121
1513
15151
15183
1529
15296
15400
15439
15447
15466
1553
1556
15584
15632
15658
15708
15749
15764
15824
15845
15922
16011
16130
16316
16324
16402
1645
16453
16464
16567
16609
16642
16650
16708
16740
16840
1689
16935
17036
17062
17067
17078
17081
17196
17205
17210
17257
17267
17357
17412
17454
17471
17481
17519
1752
17571
17614
17621
17689
17694
1776
17760
17810
17828
17856
1800
18010
1804
18175
18195
18197
18237
183
18359
18364
18367
18399
18407
1842
18483
18610
1863
18651
18721
18868
18884
18945
19017
19030
19037
19099
19104
19128
19253
19263
19313
19317
19488
19562
19637
19650
1977
19826
19844
19915
19924
19948
20001
20069
20083
2013
20227
20241
20285
20329
2044
20479
20484
20525
20615
20706
20805
20814
20898
209
21
21022
21050
21198
2174
2184
2192
2193
2198
2252
2254
2318
2395
2431
2443
2480
249
2570
2631
264
2691
271
2734
2804
2951
300
3045
3138
3148
321
3236
3239
3262
330
3307
3326
333
3344
342
3469
3512
3595
36
3602
3687
3702
3718
373
3774
382
3851
3952
3955
413
4146
4231
4256
4259
4277
4307
4412
4488
4504
4582
4711
4721
4724
4728
4731
4748
4817
4934
4953
4983
4989
4994
4996
5077
5095
5168
5218
5239
529
5331
5406
5443
5450
5494
5502
5567
5585
5644
5809
5823
5840
5845
5849
5864
5900
5924
5954
5972
5973
599
6008
6045
6129
6143
6230
626
627
6356
6387
6403
6418
6513
6529
6534
6582
661
6612
6665
6719
6745
6761
6898
6915
692
6949
7028
7039
7044
7072
7078
7113
7123
7361
750
7511
757
763
7639
7695
7788
7801
7944
800
8127
8140
8190
8196
8295
8346
8351
8368
8461
8462
8537
8548
8592
8716
8830
8848
8857
8916
8948
8974
907
9110
9122
9149
9190
9303
9373
9381
9387
9462
9478
9482
950
9524
956
9562
9604
963
9785
9787
9817
9848
9853
9889
9894
9913
10026
10055
10095
10125
10183
10221
10303
10464
10508
10513
10622
10633
10782
1080
10833
10906
10914
10952
10967
11189
11195
11213
11240
11519
11532
11534
1160
11626
11632
11636
11660
11693
11741
11811
11918
11985
12084
12085
12187
1224
12355
12368
1240
1249
12535
12539
12574
12621
12707
12868
12914
13059
13069
13090
1313
13210
13235
1327
13329
13347
13348
13365
13375
13418
13624
13787
13879
13921
13992
14008
14048
14057
14060
14101
14306
14365
14436
14494
14574
14614
1469
14734
14750
1476
14794
14889
14894
14968
1503
1505
15117
15118
15122
15224
15277
15333
15353
15356
15383
1542
15485
15487
15506
15553
15587
15603
15839
15883
15902
15952
16053
16144
16175
16218
16230
16256
16344
16501
16504
16556
16593
16624
16673
168
16883
16894
16960
17207
17224
17226
1734
17383
1742
17455
17543
17567
17569
1758
17610
17663
17743
17758
17781
17821
17843
17847
17869
17890
17891
18013
18064
18118
18235
18369
18513
18519
18548
18602
18636
18684
1874
18768
18773
1878
18783
18825
18864
18876
18957
18959
19005
19114
19150
19235
1932
1949
19652
19737
19756
19928
19999
20018
20113
20154
20173
20466
20660
20697
20768
20785
20848
20949
20995
21043
21206
2165
2249
2298
2376
2381
2389
2435
2441
2461
2529
2567
2579
2786
2848
2972
3016
3017
305
3100
3115
3139
3147
320
3371
3412
3494
3497
3523
3587
3598
360
3610
3644
3653
369
3700
3756
376
3775
3790
3869
4012
4020
4047
4207
421
4240
4269
4270
4301
4306
4319
4340
4402
4444
4469
4477
4478
4562
4572
4602
4622
4842
4854
5149
5152
5158
5166
5200
5214
5249
5260
5278
5361
5389
5411
5413
5437
5539
558
5591
5654
5751
5874
5942
5965
6009
6019
6043
6101
6122
6140
6381
6412
6584
6648
666
6679
6684
6932
7048
7086
7159
7247
7257
726
7280
7281
7299
732
7368
7376
7383
7441
7476
7491
7644
7674
7702
7761
7772
7779
7810
8
8015
8285
8477
8535
858
8633
8634
8654
8767
8793
8930
8959
9
9036
9058
909
9128
9142
9174
9185
920
9218
9302
9328
9340
9370
9395
9439
9453
9550
9647
97
9736
9776
9781
9837
9891
10018
10085
10107
10113
1013
10184
10207
10266
10290
10292
10372
10392
10397
10398
10418
10421
10441
10561
10573
10601
10644
10662
10760
10797
10810
10824
10837
10855
10867
10874
10878
10893
109
10900
11013
11042
11057
1107
11088
11121
11148
11187
11199
11212
11217
11235
11306
11318
11337
11357
11370
11372
11389
11411
11434
11460
11524
11559
11607
11611
11620
11733
11779
11857
11898
11938
11942
11960
120
1207
12070
12102
12120
12161
12166
12185
12232
12292
12396
12412
1242
12442
12516
12568
12604
12612
1266
12697
12764
12786
12806
12859
12876
12881
12898
12916
12976
12989
12999
13041
13162
13186
1319
13201
13223
13255
13256
13259
13284
1329
13297
13346
13374
13377
13417
1345
13453
13488
13548
13602
13632
13700
13806
13808
13848
13854
13870
13913
13932
13984
14037
14044
14187
14195
14228
14232
14295
14296
14328
1433
14372
14385
14390
14424
14467
14486
1455
14617
14627
14657
14671
14689
14690
14702
14715
14732
14757
14771
14772
14791
14797
14830
1491
14919
14966
14976
14986
14987
15009
15015
15031
15032
15052
15067
15076
15081
15088
1509
1510
15131
15176
15318
15319
15366
15382
15433
15454
15458
15520
15528
15532
15547
15592
15619
1570
1572
15727
15831
15852
15860
15866
15867
15876
15901
15988
16017
16020
16051
1607
16107
16122
16124
16148
16182
16200
16202
16295
16297
16311
16342
16385
16388
16395
16406
1648
16515
16524
16532
16538
16565
16572
16591
16594
16598
16625
16636
16660
16680
16685
16713
16731
16760
16841
16847
1688
1697
16973
16978
17002
17003
17007
17061
17074
17087
17089
17177
17192
17199
17216
17290
17294
17333
17339
17349
17442
17479
17496
17518
17521
17528
17533
17535
17564
17652
17654
1766
17717
17784
17876
17893
17931
17937
17958
17970
17981
17989
18033
1806
18068
18089
18092
18104
18141
18184
1822
18223
18233
18249
18260
18278
18307
18309
18324
18385
184
18410
18414
18426
18428
18434
18451
18461
18471
18477
18520
1853
18547
1858
1859
186
18634
18770
18797
1880
18824
18866
18900
18917
18921
18926
18956
